from model.flight import Flight


class FlightsStubProvider:
    def getFlights(self) -> list[Flight]:
        return [
            Flight("Лос Анжелес", "2023-06-01 09:00", "Нью-Йорк", "2023-06-01 16:30", "$350"),
            Flight("Лондон", "2023-06-02 11:45", "Париж", "2023-06-02 14:15", "$150"),
            Flight("Токіо", "2023-06-03 06:30", "Сідней", "2023-06-03 18:00", "$800"),
            Flight("Сан Франциско", "2023-06-04 14:00", "Майамі", "2023-06-04 20:30", "$400"),
            Flight("Дубаї", "2023-06-05 20:00", "Йоханнесбург", "2023-06-06 03:30", "$550"),
            Flight("Торонто", "2023-06-06 08:30", "Мехіко", "2023-06-06 12:00", "$250"),
            Flight("Пекін", "2023-06-07 13:15", "Сингапур", "2023-06-07 19:45", "$600"),
        ]
